{smcl}
{com}{sf}{ul off}{txt}{.-}
      name:  {res}<unnamed>
       {txt}log:  {res}c:\Users\eren\Desktop\fundshedge\output/data_preparation_log.txt
  {txt}log type:  {res}smcl
 {txt}opened on:  {res}12 Dec 2024, 19:51:40
{txt}
{com}. 
. ********************************************************************************
. * Install required packages
. ********************************************************************************
. * Install wbopendata from SSC
. capture ssc install wbopendata, replace
{txt}
{com}. capture ssc install estout, replace
{txt}
{com}. 
. ********************************************************************************
. * Download World Development Indicators Data
. ********************************************************************************
. 
. * Create temporary files for each indicator
. tempfile gdp trade exports imports industry gdppc inflation govt_exp education merged
{txt}
{com}. 
. * Load GDP growth data for Turkey
. clear
{txt}
{com}. wbopendata, language(en) country(TUR) year(1960:2022) indicator(NY.GDP.MKTP.KD.ZG) clear

{res}{p 4 4 4}{opt Metadata for indicator} NY.GDP.MKTP.KD.ZG{p_end}
{hline}
{p 4 4 4}{opt Name}: GDP growth (annual %){p_end}
{hline}
{p 4 4 4}{opt Collection}: 2 World Development Indicators{p_end}
{hline}
{p 4 4 4}{opt Description}: Annual percentage growth rate of GDP at market prices based on constant local currency. Aggregates are based on constant 2015 prices, expressed in U.S. dollars. GDP is the sum of gross value added by all resident producers in the economy plus any product taxes and minus any subsidies not included in the value of the products. It is calculated without making deductions for depreciation of fabricated assets or for depletion and degradation of natural resources.{p_end}
{hline}
{p 4 4 4}{opt Note}: World Bank national accounts data, and OECD National Accounts data files.{p_end}
{hline}
{p 4 4 4}{opt Topic(s)}: 3 Economy and Growth  {p_end}
{hline}


{txt}
{com}. keep if countryname == "Turkey"
{txt}(0 observations deleted)

{com}. keep yr* countryname
{txt}
{com}. reshape long yr, i(countryname) j(year)
{txt}(j = 1960 1961 1962 1963 1964 1965 1966 1967 1968 1969 1970 1971 1972 1973 1974 1975 1976 1977 1978 1979 1980 1981 1982 1983 1984 1985 1986 1987 1988 1989 1990 1991 1992 1993 1994 1995 1996 1997 1998 1999 2000 2001 2002 2003 2004 2005 2006 2007 2008 2009 2010 2011 2012 2013 2014 2015 2016 2017 2018 2019 2020 2021 2022)

Data{col 36}Wide{col 43}->{col 48}Long
{hline 77}
Number of observations     {res}           1   {txt}->   {res}63          
{txt}Number of variables        {res}          64   {txt}->   {res}3           
{txt}j variable (63 values)                    ->   {res}year
{txt}xij variables:
               {res}yr1960 yr1961 ... yr2022   {txt}->   {res}yr
{txt}{hline 77}

{com}. rename yr gdp_growth
{res}{txt}
{com}. save `gdp'
{txt}{p 0 4 2}
file {bf}
C:\Users\eren\AppData\Local\Temp\ST_2a44_000001.tmp{rm}
saved
as .dta format
{p_end}

{com}. 
. * Download trade
. clear
{txt}
{com}. wbopendata, language(en) country(TUR) year(1960:2022) indicator(NE.TRD.GNFS.ZS) clear

{res}{p 4 4 4}{opt Metadata for indicator} NE.TRD.GNFS.ZS{p_end}
{hline}
{p 4 4 4}{opt Name}: Trade (% of GDP){p_end}
{hline}
{p 4 4 4}{opt Collection}: 2 World Development Indicators{p_end}
{hline}
{p 4 4 4}{opt Description}: Trade is the sum of exports and imports of goods and services measured as a share of gross domestic product.{p_end}
{hline}
{p 4 4 4}{opt Note}: World Bank national accounts data, and OECD National Accounts data files.{p_end}
{hline}
{p 4 4 4}{opt Topic(s)}: 3 Economy and Growth ; 21 Trade {p_end}
{hline}


{txt}
{com}. keep if countryname == "Turkey"
{txt}(0 observations deleted)

{com}. keep yr* countryname
{txt}
{com}. reshape long yr, i(countryname) j(year)
{txt}(j = 1960 1961 1962 1963 1964 1965 1966 1967 1968 1969 1970 1971 1972 1973 1974 1975 1976 1977 1978 1979 1980 1981 1982 1983 1984 1985 1986 1987 1988 1989 1990 1991 1992 1993 1994 1995 1996 1997 1998 1999 2000 2001 2002 2003 2004 2005 2006 2007 2008 2009 2010 2011 2012 2013 2014 2015 2016 2017 2018 2019 2020 2021 2022)

Data{col 36}Wide{col 43}->{col 48}Long
{hline 77}
Number of observations     {res}           1   {txt}->   {res}63          
{txt}Number of variables        {res}          64   {txt}->   {res}3           
{txt}j variable (63 values)                    ->   {res}year
{txt}xij variables:
               {res}yr1960 yr1961 ... yr2022   {txt}->   {res}yr
{txt}{hline 77}

{com}. rename yr trade_gdp
{res}{txt}
{com}. save `trade'
{txt}{p 0 4 2}
file {bf}
C:\Users\eren\AppData\Local\Temp\ST_2a44_000002.tmp{rm}
saved
as .dta format
{p_end}

{com}. 
. * Download exports
. clear
{txt}
{com}. wbopendata, language(en) country(TUR) year(1960:2022) indicator(NE.EXP.GNFS.ZS) clear

{res}{p 4 4 4}{opt Metadata for indicator} NE.EXP.GNFS.ZS{p_end}
{hline}
{p 4 4 4}{opt Name}: Exports of goods and services (% of GDP){p_end}
{hline}
{p 4 4 4}{opt Collection}: 2 World Development Indicators{p_end}
{hline}
{p 4 4 4}{opt Description}: Exports of goods and services represent the value of all goods and other market services provided to the rest of the world. They include the value of merchandise, freight, insurance, transport, travel, royalties, license fees, and other services, such as communication, construction, financial, information, business, personal, and government services. They exclude compensation of employees and investment income (formerly called factor services) and transfer payments.{p_end}
{hline}
{p 4 4 4}{opt Note}: World Bank national accounts data, and OECD National Accounts data files.{p_end}
{hline}
{p 4 4 4}{opt Topic(s)}: 3 Economy and Growth ; 21 Trade {p_end}
{hline}


{txt}
{com}. keep if countryname == "Turkey"
{txt}(0 observations deleted)

{com}. keep yr* countryname
{txt}
{com}. reshape long yr, i(countryname) j(year)
{txt}(j = 1960 1961 1962 1963 1964 1965 1966 1967 1968 1969 1970 1971 1972 1973 1974 1975 1976 1977 1978 1979 1980 1981 1982 1983 1984 1985 1986 1987 1988 1989 1990 1991 1992 1993 1994 1995 1996 1997 1998 1999 2000 2001 2002 2003 2004 2005 2006 2007 2008 2009 2010 2011 2012 2013 2014 2015 2016 2017 2018 2019 2020 2021 2022)

Data{col 36}Wide{col 43}->{col 48}Long
{hline 77}
Number of observations     {res}           1   {txt}->   {res}63          
{txt}Number of variables        {res}          64   {txt}->   {res}3           
{txt}j variable (63 values)                    ->   {res}year
{txt}xij variables:
               {res}yr1960 yr1961 ... yr2022   {txt}->   {res}yr
{txt}{hline 77}

{com}. rename yr exports_gdp
{res}{txt}
{com}. save `exports'
{txt}{p 0 4 2}
file {bf}
C:\Users\eren\AppData\Local\Temp\ST_2a44_000003.tmp{rm}
saved
as .dta format
{p_end}

{com}. 
. * Download imports
. clear
{txt}
{com}. wbopendata, language(en) country(TUR) year(1960:2022) indicator(NE.IMP.GNFS.ZS) clear

{res}{p 4 4 4}{opt Metadata for indicator} NE.IMP.GNFS.ZS{p_end}
{hline}
{p 4 4 4}{opt Name}: Imports of goods and services (% of GDP){p_end}
{hline}
{p 4 4 4}{opt Collection}: 2 World Development Indicators{p_end}
{hline}
{p 4 4 4}{opt Description}: Imports of goods and services represent the value of all goods and other market services received from the rest of the world. They include the value of merchandise, freight, insurance, transport, travel, royalties, license fees, and other services, such as communication, construction, financial, information, business, personal, and government services. They exclude compensation of employees and investment income (formerly called factor services) and transfer payments.{p_end}
{hline}
{p 4 4 4}{opt Note}: World Bank national accounts data, and OECD National Accounts data files.{p_end}
{hline}
{p 4 4 4}{opt Topic(s)}: 3 Economy and Growth ; 21 Trade {p_end}
{hline}


{txt}
{com}. keep if countryname == "Turkey"
{txt}(0 observations deleted)

{com}. keep yr* countryname
{txt}
{com}. reshape long yr, i(countryname) j(year)
{txt}(j = 1960 1961 1962 1963 1964 1965 1966 1967 1968 1969 1970 1971 1972 1973 1974 1975 1976 1977 1978 1979 1980 1981 1982 1983 1984 1985 1986 1987 1988 1989 1990 1991 1992 1993 1994 1995 1996 1997 1998 1999 2000 2001 2002 2003 2004 2005 2006 2007 2008 2009 2010 2011 2012 2013 2014 2015 2016 2017 2018 2019 2020 2021 2022)

Data{col 36}Wide{col 43}->{col 48}Long
{hline 77}
Number of observations     {res}           1   {txt}->   {res}63          
{txt}Number of variables        {res}          64   {txt}->   {res}3           
{txt}j variable (63 values)                    ->   {res}year
{txt}xij variables:
               {res}yr1960 yr1961 ... yr2022   {txt}->   {res}yr
{txt}{hline 77}

{com}. rename yr imports_gdp
{res}{txt}
{com}. save `imports'
{txt}{p 0 4 2}
file {bf}
C:\Users\eren\AppData\Local\Temp\ST_2a44_000004.tmp{rm}
saved
as .dta format
{p_end}

{com}. 
. * Download industry value added
. clear
{txt}
{com}. wbopendata, language(en) country(TUR) year(1960:2022) indicator(NV.IND.TOTL.ZS) clear

{res}{p 4 4 4}{opt Metadata for indicator} NV.IND.TOTL.ZS{p_end}
{hline}
{p 4 4 4}{opt Name}: Industry (including construction), value added (% of GDP){p_end}
{hline}
{p 4 4 4}{opt Collection}: 2 World Development Indicators{p_end}
{hline}
{p 4 4 4}{opt Description}: Industry (including construction) corresponds to ISIC divisions 05-43 and includes manufacturing (ISIC divisions 10-33). It comprises value added in mining, manufacturing (also reported as a separate subgroup), construction, electricity, water, and gas. Value added is the net output of a sector after adding up all outputs and subtracting intermediate inputs. It is calculated without making deductions for depreciation of fabricated assets or depletion and degradation of natural resources. The origin of value added is determined by the International Standard Industrial Classification (ISIC), revision 4. Note: For VAB countries, gross value added at factor cost is used as the denominator.{p_end}
{hline}
{p 4 4 4}{opt Note}: World Bank national accounts data, and OECD National Accounts data files.{p_end}
{hline}
{p 4 4 4}{opt Topic(s)}: 3 Economy and Growth  {p_end}
{hline}


{txt}
{com}. keep if countryname == "Turkey"
{txt}(0 observations deleted)

{com}. keep yr* countryname
{txt}
{com}. reshape long yr, i(countryname) j(year)
{txt}(j = 1960 1961 1962 1963 1964 1965 1966 1967 1968 1969 1970 1971 1972 1973 1974 1975 1976 1977 1978 1979 1980 1981 1982 1983 1984 1985 1986 1987 1988 1989 1990 1991 1992 1993 1994 1995 1996 1997 1998 1999 2000 2001 2002 2003 2004 2005 2006 2007 2008 2009 2010 2011 2012 2013 2014 2015 2016 2017 2018 2019 2020 2021 2022)

Data{col 36}Wide{col 43}->{col 48}Long
{hline 77}
Number of observations     {res}           1   {txt}->   {res}63          
{txt}Number of variables        {res}          64   {txt}->   {res}3           
{txt}j variable (63 values)                    ->   {res}year
{txt}xij variables:
               {res}yr1960 yr1961 ... yr2022   {txt}->   {res}yr
{txt}{hline 77}

{com}. rename yr investment
{res}{txt}
{com}. save `industry'
{txt}{p 0 4 2}
file {bf}
C:\Users\eren\AppData\Local\Temp\ST_2a44_000005.tmp{rm}
saved
as .dta format
{p_end}

{com}. 
. * Download GDP per capita
. clear
{txt}
{com}. wbopendata, language(en) country(TUR) year(1960:2022) indicator(NY.GDP.PCAP.KD) clear

{res}{p 4 4 4}{opt Metadata for indicator} NY.GDP.PCAP.KD{p_end}
{hline}
{p 4 4 4}{opt Name}: GDP per capita (constant 2015 US$){p_end}
{hline}
{p 4 4 4}{opt Collection}: 2 World Development Indicators{p_end}
{hline}
{p 4 4 4}{opt Description}: GDP per capita is gross domestic product divided by midyear population. GDP is the sum of gross value added by all resident producers in the economy plus any product taxes and minus any subsidies not included in the value of the products. It is calculated without making deductions for depreciation of fabricated assets or for depletion and degradation of natural resources. Data are in constant 2015 U.S. dollars.{p_end}
{hline}
{p 4 4 4}{opt Note}: World Bank national accounts data, and OECD National Accounts data files.{p_end}
{hline}
{p 4 4 4}{opt Topic(s)}: 3 Economy and Growth  {p_end}
{hline}


{txt}
{com}. keep if countryname == "Turkey"
{txt}(0 observations deleted)

{com}. keep yr* countryname
{txt}
{com}. reshape long yr, i(countryname) j(year)
{txt}(j = 1960 1961 1962 1963 1964 1965 1966 1967 1968 1969 1970 1971 1972 1973 1974 1975 1976 1977 1978 1979 1980 1981 1982 1983 1984 1985 1986 1987 1988 1989 1990 1991 1992 1993 1994 1995 1996 1997 1998 1999 2000 2001 2002 2003 2004 2005 2006 2007 2008 2009 2010 2011 2012 2013 2014 2015 2016 2017 2018 2019 2020 2021 2022)

Data{col 36}Wide{col 43}->{col 48}Long
{hline 77}
Number of observations     {res}           1   {txt}->   {res}63          
{txt}Number of variables        {res}          64   {txt}->   {res}3           
{txt}j variable (63 values)                    ->   {res}year
{txt}xij variables:
               {res}yr1960 yr1961 ... yr2022   {txt}->   {res}yr
{txt}{hline 77}

{com}. rename yr gdp_pc
{res}{txt}
{com}. save `gdppc'
{txt}{p 0 4 2}
file {bf}
C:\Users\eren\AppData\Local\Temp\ST_2a44_000006.tmp{rm}
saved
as .dta format
{p_end}

{com}. 
. * Download inflation
. clear
{txt}
{com}. wbopendata, language(en) country(TUR) year(1960:2022) indicator(FP.CPI.TOTL.ZG) clear

{res}{p 4 4 4}{opt Metadata for indicator} FP.CPI.TOTL.ZG{p_end}
{hline}
{p 4 4 4}{opt Name}: Inflation, consumer prices (annual %){p_end}
{hline}
{p 4 4 4}{opt Collection}: 2 World Development Indicators{p_end}
{hline}
{p 4 4 4}{opt Description}: Inflation as measured by the consumer price index reflects the annual percentage change in the cost to the average consumer of acquiring a basket of goods and services that may be fixed or changed at specified intervals, such as yearly. The Laspeyres formula is generally used.{p_end}
{hline}
{p 4 4 4}{opt Note}: International Monetary Fund, International Financial Statistics and data files.{p_end}
{hline}
{p 4 4 4}{opt Topic(s)}: 3 Economy and Growth ; 7 Financial Sector {p_end}
{hline}


{txt}
{com}. keep if countryname == "Turkey"
{txt}(0 observations deleted)

{com}. keep yr* countryname
{txt}
{com}. reshape long yr, i(countryname) j(year)
{txt}(j = 1960 1961 1962 1963 1964 1965 1966 1967 1968 1969 1970 1971 1972 1973 1974 1975 1976 1977 1978 1979 1980 1981 1982 1983 1984 1985 1986 1987 1988 1989 1990 1991 1992 1993 1994 1995 1996 1997 1998 1999 2000 2001 2002 2003 2004 2005 2006 2007 2008 2009 2010 2011 2012 2013 2014 2015 2016 2017 2018 2019 2020 2021 2022)

Data{col 36}Wide{col 43}->{col 48}Long
{hline 77}
Number of observations     {res}           1   {txt}->   {res}63          
{txt}Number of variables        {res}          64   {txt}->   {res}3           
{txt}j variable (63 values)                    ->   {res}year
{txt}xij variables:
               {res}yr1960 yr1961 ... yr2022   {txt}->   {res}yr
{txt}{hline 77}

{com}. rename yr inflation
{res}{txt}
{com}. save `inflation'
{txt}{p 0 4 2}
file {bf}
C:\Users\eren\AppData\Local\Temp\ST_2a44_000007.tmp{rm}
saved
as .dta format
{p_end}

{com}. 
. * Download government expenditure
. clear
{txt}
{com}. wbopendata, language(en) country(TUR) year(1960:2022) indicator(GC.XPN.TOTL.GD.ZS) clear

{res}{p 4 4 4}{opt Metadata for indicator} GC.XPN.TOTL.GD.ZS{p_end}
{hline}
{p 4 4 4}{opt Name}: Expense (% of GDP){p_end}
{hline}
{p 4 4 4}{opt Collection}: 2 World Development Indicators{p_end}
{hline}
{p 4 4 4}{opt Description}: Expense is cash payments for operating activities of the government in providing goods and services. It includes compensation of employees (such as wages and salaries), interest and subsidies, grants, social benefits, and other expenses such as rent and dividends.{p_end}
{hline}
{p 4 4 4}{opt Note}: International Monetary Fund, Government Finance Statistics Yearbook and data files, and World Bank and OECD GDP estimates.{p_end}
{hline}
{p 4 4 4}{opt Topic(s)}: 3 Economy and Growth ; 13 Public Sector {p_end}
{hline}


{txt}
{com}. keep if countryname == "Turkey"
{txt}(0 observations deleted)

{com}. keep yr* countryname
{txt}
{com}. reshape long yr, i(countryname) j(year)
{txt}(j = 1960 1961 1962 1963 1964 1965 1966 1967 1968 1969 1970 1971 1972 1973 1974 1975 1976 1977 1978 1979 1980 1981 1982 1983 1984 1985 1986 1987 1988 1989 1990 1991 1992 1993 1994 1995 1996 1997 1998 1999 2000 2001 2002 2003 2004 2005 2006 2007 2008 2009 2010 2011 2012 2013 2014 2015 2016 2017 2018 2019 2020 2021 2022)

Data{col 36}Wide{col 43}->{col 48}Long
{hline 77}
Number of observations     {res}           1   {txt}->   {res}63          
{txt}Number of variables        {res}          64   {txt}->   {res}3           
{txt}j variable (63 values)                    ->   {res}year
{txt}xij variables:
               {res}yr1960 yr1961 ... yr2022   {txt}->   {res}yr
{txt}{hline 77}

{com}. rename yr govt_exp
{res}{txt}
{com}. save `govt_exp'
{txt}{p 0 4 2}
file {bf}
C:\Users\eren\AppData\Local\Temp\ST_2a44_000008.tmp{rm}
saved
as .dta format
{p_end}

{com}. 
. * Download tertiary education
. clear
{txt}
{com}. wbopendata, language(en) country(TUR) year(1960:2022) indicator(SE.ENR.TERT.FM.ZS) clear

{res}{p 4 4 4}{opt Metadata for indicator} SE.ENR.TERT.FM.ZS{p_end}
{hline}
{p 4 4 4}{opt Name}: School enrollment, tertiary (gross), gender parity index (GPI){p_end}
{hline}
{p 4 4 4}{opt Collection}: 2 World Development Indicators{p_end}
{hline}
{p 4 4 4}{opt Description}: Gender parity index for gross enrollment ratio in tertiary education is the ratio of women to men enrolled at tertiary level in public and private schools.{p_end}
{hline}
{p 4 4 4}{opt Note}: UNESCO Institute for Statistics (UIS). UIS.Stat Bulk Data Download Service. Accessed September 30, 2024. {browse {err}https:"{c )-}  apiportal.uis.unesco.org bdds.{c -(}p_end{c )-}"{err} {err}invalid{err} {err}name

{p 4 4 2} Sorry... No metadata available for {res}SE.ENR.TERT.FM.ZS. {p_end}

{txt}
{com}. keep if countryname == "Turkey"
{txt}(0 observations deleted)

{com}. keep yr* countryname
{txt}
{com}. reshape long yr, i(countryname) j(year)
{txt}(j = 1960 1961 1962 1963 1964 1965 1966 1967 1968 1969 1970 1971 1972 1973 1974 1975 1976 1977 1978 1979 1980 1981 1982 1983 1984 1985 1986 1987 1988 1989 1990 1991 1992 1993 1994 1995 1996 1997 1998 1999 2000 2001 2002 2003 2004 2005 2006 2007 2008 2009 2010 2011 2012 2013 2014 2015 2016 2017 2018 2019 2020 2021 2022)

Data{col 36}Wide{col 43}->{col 48}Long
{hline 77}
Number of observations     {res}           1   {txt}->   {res}63          
{txt}Number of variables        {res}          64   {txt}->   {res}3           
{txt}j variable (63 values)                    ->   {res}year
{txt}xij variables:
               {res}yr1960 yr1961 ... yr2022   {txt}->   {res}yr
{txt}{hline 77}

{com}. rename yr tertiary_educ
{res}{txt}
{com}. save `education'
{txt}{p 0 4 2}
file {bf}
C:\Users\eren\AppData\Local\Temp\ST_2a44_000009.tmp{rm}
saved
as .dta format
{p_end}

{com}. 
. * Merge all datasets
. use `gdp', clear
{txt}
{com}. merge 1:1 year using `trade', nogen
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}               0
{txt}{col 5}Matched{col 30}{res}              63{txt}  
{col 5}{hline 41}

{com}. merge 1:1 year using `exports', nogen
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}               0
{txt}{col 5}Matched{col 30}{res}              63{txt}  
{col 5}{hline 41}

{com}. merge 1:1 year using `imports', nogen
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}               0
{txt}{col 5}Matched{col 30}{res}              63{txt}  
{col 5}{hline 41}

{com}. merge 1:1 year using `industry', nogen
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}               0
{txt}{col 5}Matched{col 30}{res}              63{txt}  
{col 5}{hline 41}

{com}. merge 1:1 year using `gdppc', nogen
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}               0
{txt}{col 5}Matched{col 30}{res}              63{txt}  
{col 5}{hline 41}

{com}. merge 1:1 year using `inflation', nogen
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}               0
{txt}{col 5}Matched{col 30}{res}              63{txt}  
{col 5}{hline 41}

{com}. merge 1:1 year using `govt_exp', nogen
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}               0
{txt}{col 5}Matched{col 30}{res}              63{txt}  
{col 5}{hline 41}

{com}. merge 1:1 year using `education', nogen
{res}
{txt}{col 5}Result{col 33}Number of obs
{col 5}{hline 41}
{col 5}Not matched{col 30}{res}               0
{txt}{col 5}Matched{col 30}{res}              63{txt}  
{col 5}{hline 41}

{com}. 
. * Label variables
. label variable gdp_growth "GDP Growth (annual %)"
{txt}
{com}. label variable trade_gdp "Trade (% of GDP)"
{txt}
{com}. label variable exports_gdp "Exports (% of GDP)"
{txt}
{com}. label variable imports_gdp "Imports (% of GDP)"
{txt}
{com}. label variable investment "Industry Value Added (% of GDP)"
{txt}
{com}. label variable gdp_pc "GDP per capita (constant 2015 US$)"
{txt}
{com}. label variable inflation "Inflation, consumer prices (annual %)"
{txt}
{com}. label variable govt_exp "Government Expenditure (% of GDP)"
{txt}
{com}. label variable tertiary_educ "School enrollment, tertiary (% gross)"
{txt}
{com}. 
. * Generate interaction terms and squared terms
. generate trade_inv_int = trade_gdp * investment
{txt}
{com}. generate trade_educ_int = trade_gdp * tertiary_educ
{txt}(14 missing values generated)

{com}. generate trade_gdp_sq = trade_gdp^2
{txt}
{com}. 
. * Label generated variables
. label variable trade_inv_int "Trade-Investment Interaction"
{txt}
{com}. label variable trade_educ_int "Trade-Education Interaction"
{txt}
{com}. label variable trade_gdp_sq "Trade Squared"
{txt}
{com}. 
. * Save final dataset
. save "data/turkey_macro_data.dta", replace
{txt}{p 0 4 2}
file {bf}
data/turkey_macro_data.dta{rm}
saved
{p_end}

{com}. 
. * Export to Excel
. export excel using "data/turkey_macro_data.xlsx", firstrow(variables) replace
{res}{txt}file {bf:data/turkey_macro_data.xlsx} saved

{com}. 
. * Close log file
. log close
      {txt}name:  {res}<unnamed>
       {txt}log:  {res}c:\Users\eren\Desktop\fundshedge\output/data_preparation_log.txt
  {txt}log type:  {res}smcl
 {txt}closed on:  {res}12 Dec 2024, 19:52:25
{txt}{.-}
{smcl}
{txt}{sf}{ul off}